<?xml version="1.0" ?>
<net batch="1" name="zwnet_model-0000" version="6">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="_mulscalar0/lin_/Fused_Mul_/fused_power" precision="FP32" type="Power">
			<data power="1" scale="0.0078125" shift="-0.99609375"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv_1_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="3456"/>
				<biases offset="3456" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="conv_1_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3584" size="128"/>
			</blobs>
		</layer>
		<layer id="4" name="conv_2_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3712" size="2304"/>
				<biases offset="6016" size="256"/>
			</blobs>
		</layer>
		<layer id="5" name="conv_2_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6272" size="256"/>
			</blobs>
		</layer>
		<layer id="6" name="dconv_23_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6528" size="16384"/>
				<biases offset="22912" size="256"/>
			</blobs>
		</layer>
		<layer id="7" name="dconv_23_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="23168" size="256"/>
			</blobs>
		</layer>
		<layer id="8" name="dconv_23_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="5,5" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="23424" size="6400"/>
				<biases offset="29824" size="256"/>
			</blobs>
		</layer>
		<layer id="9" name="dconv_23_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30080" size="256"/>
			</blobs>
		</layer>
		<layer id="10" name="dconv_23_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30336" size="16384"/>
				<biases offset="46720" size="256"/>
			</blobs>
		</layer>
		<layer id="11" name="res_3_block0_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="46976" size="16384"/>
				<biases offset="63360" size="256"/>
			</blobs>
		</layer>
		<layer id="12" name="res_3_block0_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="63616" size="256"/>
			</blobs>
		</layer>
		<layer id="13" name="res_3_block0_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="5,5" output="64" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="63872" size="6400"/>
				<biases offset="70272" size="256"/>
			</blobs>
		</layer>
		<layer id="14" name="res_3_block0_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="70528" size="256"/>
			</blobs>
		</layer>
		<layer id="15" name="res_3_block0_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="70784" size="16384"/>
				<biases offset="87168" size="256"/>
			</blobs>
		</layer>
		<layer id="16" name="_plus0" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="res_3_block1_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="87424" size="16384"/>
				<biases offset="103808" size="256"/>
			</blobs>
		</layer>
		<layer id="18" name="res_3_block1_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="104064" size="256"/>
			</blobs>
		</layer>
		<layer id="19" name="res_3_block1_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="5,5" output="64" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="104320" size="6400"/>
				<biases offset="110720" size="256"/>
			</blobs>
		</layer>
		<layer id="20" name="res_3_block1_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="110976" size="256"/>
			</blobs>
		</layer>
		<layer id="21" name="res_3_block1_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="111232" size="16384"/>
				<biases offset="127616" size="256"/>
			</blobs>
		</layer>
		<layer id="22" name="_plus1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="res_3_block2_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="127872" size="16384"/>
				<biases offset="144256" size="256"/>
			</blobs>
		</layer>
		<layer id="24" name="res_3_block2_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="144512" size="256"/>
			</blobs>
		</layer>
		<layer id="25" name="res_3_block2_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="5,5" output="64" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="144768" size="6400"/>
				<biases offset="151168" size="256"/>
			</blobs>
		</layer>
		<layer id="26" name="res_3_block2_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="151424" size="256"/>
			</blobs>
		</layer>
		<layer id="27" name="res_3_block2_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="151680" size="16384"/>
				<biases offset="168064" size="256"/>
			</blobs>
		</layer>
		<layer id="28" name="_plus2" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv_34_block0_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="90" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="168320" size="23040"/>
				<biases offset="191360" size="360"/>
			</blobs>
		</layer>
		<layer id="30" name="conv_34_block0_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="191720" size="360"/>
			</blobs>
		</layer>
		<layer id="31" name="conv_34_block0_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="90" kernel="3,3" output="90" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="192080" size="3240"/>
				<biases offset="195320" size="360"/>
			</blobs>
		</layer>
		<layer id="32" name="conv_34_block0_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="195680" size="360"/>
			</blobs>
		</layer>
		<layer id="33" name="conv_34_block0_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="196040" size="23040"/>
				<biases offset="219080" size="256"/>
			</blobs>
		</layer>
		<layer id="34" name="_plus3" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv_34_block1_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="90" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="219336" size="23040"/>
				<biases offset="242376" size="360"/>
			</blobs>
		</layer>
		<layer id="36" name="conv_34_block1_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="242736" size="360"/>
			</blobs>
		</layer>
		<layer id="37" name="conv_34_block1_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="90" kernel="3,3" output="90" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="243096" size="3240"/>
				<biases offset="246336" size="360"/>
			</blobs>
		</layer>
		<layer id="38" name="conv_34_block1_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="246696" size="360"/>
			</blobs>
		</layer>
		<layer id="39" name="conv_34_block1_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="247056" size="23040"/>
				<biases offset="270096" size="256"/>
			</blobs>
		</layer>
		<layer id="40" name="_plus4" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv_34_block2_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="90" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="270352" size="23040"/>
				<biases offset="293392" size="360"/>
			</blobs>
		</layer>
		<layer id="42" name="conv_34_block2_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="293752" size="360"/>
			</blobs>
		</layer>
		<layer id="43" name="conv_34_block2_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="90" kernel="3,3" output="90" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="294112" size="3240"/>
				<biases offset="297352" size="360"/>
			</blobs>
		</layer>
		<layer id="44" name="conv_34_block2_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="297712" size="360"/>
			</blobs>
		</layer>
		<layer id="45" name="conv_34_block2_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="298072" size="23040"/>
				<biases offset="321112" size="256"/>
			</blobs>
		</layer>
		<layer id="46" name="_plus5" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv_34_block3_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="90" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="321368" size="23040"/>
				<biases offset="344408" size="360"/>
			</blobs>
		</layer>
		<layer id="48" name="conv_34_block3_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="344768" size="360"/>
			</blobs>
		</layer>
		<layer id="49" name="conv_34_block3_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="90" kernel="3,3" output="90" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="345128" size="3240"/>
				<biases offset="348368" size="360"/>
			</blobs>
		</layer>
		<layer id="50" name="conv_34_block3_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="348728" size="360"/>
			</blobs>
		</layer>
		<layer id="51" name="conv_34_block3_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>90</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="349088" size="23040"/>
				<biases offset="372128" size="256"/>
			</blobs>
		</layer>
		<layer id="52" name="_plus6" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="dconv_35_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="180" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>180</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="372384" size="46080"/>
				<biases offset="418464" size="720"/>
			</blobs>
		</layer>
		<layer id="54" name="dconv_35_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>180</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
			<blobs>
				<weights offset="419184" size="720"/>
			</blobs>
		</layer>
		<layer id="55" name="dconv_35_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="180" kernel="5,5" output="180" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="419904" size="18000"/>
				<biases offset="437904" size="720"/>
			</blobs>
		</layer>
		<layer id="56" name="dconv_35_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="438624" size="720"/>
			</blobs>
		</layer>
		<layer id="57" name="dconv_35_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="439344" size="92160"/>
				<biases offset="531504" size="512"/>
			</blobs>
		</layer>
		<layer id="58" name="res_4_block0_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="532016" size="131072"/>
				<biases offset="663088" size="1024"/>
			</blobs>
		</layer>
		<layer id="59" name="res_4_block0_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="664112" size="1024"/>
			</blobs>
		</layer>
		<layer id="60" name="res_4_block0_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="256" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="665136" size="9216"/>
				<biases offset="674352" size="1024"/>
			</blobs>
		</layer>
		<layer id="61" name="res_4_block0_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="675376" size="1024"/>
			</blobs>
		</layer>
		<layer id="62" name="res_4_block0_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="676400" size="131072"/>
				<biases offset="807472" size="512"/>
			</blobs>
		</layer>
		<layer id="63" name="_plus7" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="res_4_block1_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="807984" size="131072"/>
				<biases offset="939056" size="1024"/>
			</blobs>
		</layer>
		<layer id="65" name="res_4_block1_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="940080" size="1024"/>
			</blobs>
		</layer>
		<layer id="66" name="res_4_block1_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="256" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="941104" size="9216"/>
				<biases offset="950320" size="1024"/>
			</blobs>
		</layer>
		<layer id="67" name="res_4_block1_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="951344" size="1024"/>
			</blobs>
		</layer>
		<layer id="68" name="res_4_block1_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="952368" size="131072"/>
				<biases offset="1083440" size="512"/>
			</blobs>
		</layer>
		<layer id="69" name="_plus8" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="res_4_block2_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1083952" size="131072"/>
				<biases offset="1215024" size="1024"/>
			</blobs>
		</layer>
		<layer id="71" name="res_4_block2_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1216048" size="1024"/>
			</blobs>
		</layer>
		<layer id="72" name="res_4_block2_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="256" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1217072" size="9216"/>
				<biases offset="1226288" size="1024"/>
			</blobs>
		</layer>
		<layer id="73" name="res_4_block2_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1227312" size="1024"/>
			</blobs>
		</layer>
		<layer id="74" name="res_4_block2_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1228336" size="131072"/>
				<biases offset="1359408" size="512"/>
			</blobs>
		</layer>
		<layer id="75" name="_plus9" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv_44_block0_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="180" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1359920" size="92160"/>
				<biases offset="1452080" size="720"/>
			</blobs>
		</layer>
		<layer id="77" name="conv_44_block0_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1452800" size="720"/>
			</blobs>
		</layer>
		<layer id="78" name="conv_44_block0_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="180" kernel="5,5" output="180" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1453520" size="18000"/>
				<biases offset="1471520" size="720"/>
			</blobs>
		</layer>
		<layer id="79" name="conv_44_block0_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1472240" size="720"/>
			</blobs>
		</layer>
		<layer id="80" name="conv_44_block0_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1472960" size="92160"/>
				<biases offset="1565120" size="512"/>
			</blobs>
		</layer>
		<layer id="81" name="_plus10" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv_44_block1_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="180" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1565632" size="92160"/>
				<biases offset="1657792" size="720"/>
			</blobs>
		</layer>
		<layer id="83" name="conv_44_block1_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1658512" size="720"/>
			</blobs>
		</layer>
		<layer id="84" name="conv_44_block1_conv_dw_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="180" kernel="5,5" output="180" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1659232" size="18000"/>
				<biases offset="1677232" size="720"/>
			</blobs>
		</layer>
		<layer id="85" name="conv_44_block1_conv_dw_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1677952" size="720"/>
			</blobs>
		</layer>
		<layer id="86" name="conv_44_block1_conv_proj_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1678672" size="92160"/>
				<biases offset="1770832" size="512"/>
			</blobs>
		</layer>
		<layer id="87" name="_plus11" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv_44_block2_conv_sep_conv2d" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="180" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1771344" size="92160"/>
				<biases offset="1863504" size="720"/>
			</blobs>
		</layer>
		<layer id="89" name="conv_44_block2_conv_sep_relu" precision="FP32" type="PReLU">
			<data channel_shared="0" filler_type="constant" filler_value="0" max="1" mean="0" min="0" sparse="-1" std="0" variance_norm="caffe.FillerParameter.FAN_IN"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>180</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
